results/aws-m5d.large-ebs/reports/lcs.32k.fio.out
lcs_setup: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
lcs_32k_write: (g=1): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
lcs_32k_read: (g=1): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
fio-3.10-28-g9f2c
Starting 3 threads
lcs_setup: Laying out IO files (10 files / total 1600MiB)
lcs_32k_write: Laying out IO files (10 files / total 1600MiB)
lcs_32k_read: Laying out IO files (10 files / total 1600MiB)

lcs_setup: (groupid=0, jobs=1): err= 0: pid=5502: Mon Sep 24 13:12:17 2018
  write: IOPS=1507, BW=47.1MiB/s (49.4MB/s)(47.8MiB/1014msec)
    slat (nsec): min=2951, max=40026, avg=4591.38, stdev=1711.21
    clat (usec): min=707, max=9758, avg=5253.45, stdev=1686.06
     lat (usec): min=748, max=9763, avg=5258.13, stdev=1685.99
    clat percentiles (usec):
     |  1.00th=[ 1336],  5.00th=[ 1631], 10.00th=[ 1926], 20.00th=[ 4686],
     | 30.00th=[ 5604], 40.00th=[ 5735], 50.00th=[ 5866], 60.00th=[ 5997],
     | 70.00th=[ 6063], 80.00th=[ 6259], 90.00th=[ 6456], 95.00th=[ 6718],
     | 99.00th=[ 8160], 99.50th=[ 8848], 99.90th=[ 9765], 99.95th=[ 9765],
     | 99.99th=[ 9765]
   bw (  KiB/s): min=42624, max=54720, per=100.00%, avg=48672.00, stdev=8553.16, samples=2
   iops        : min= 1332, max= 1710, avg=1521.00, stdev=267.29, samples=2
  lat (usec)   : 750=0.07%, 1000=0.07%
  lat (msec)   : 2=10.92%, 4=8.04%, 10=80.90%
  cpu          : usr=1.18%, sys=0.39%, ctx=1462, majf=0, minf=1
  IO depths    : 1=0.7%, 2=0.1%, 4=0.3%, 8=99.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1529,0,10 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_32k_write: (groupid=1, jobs=1): err= 0: pid=5503: Mon Sep 24 13:12:17 2018
  write: IOPS=2022, BW=63.2MiB/s (66.3MB/s)(3792MiB/60003msec)
    slat (usec): min=2, max=3876, avg= 4.44, stdev=11.19
    clat (usec): min=797, max=154184, avg=3950.36, stdev=3223.68
     lat (usec): min=802, max=154188, avg=3954.94, stdev=3223.66
    clat percentiles (usec):
     |  1.00th=[  1418],  5.00th=[  3490], 10.00th=[  3654], 20.00th=[  3752],
     | 30.00th=[  3818], 40.00th=[  3851], 50.00th=[  3884], 60.00th=[  3949],
     | 70.00th=[  3982], 80.00th=[  4047], 90.00th=[  4146], 95.00th=[  4228],
     | 99.00th=[  5932], 99.50th=[  6390], 99.90th=[  9765], 99.95th=[112722],
     | 99.99th=[143655]
   bw (  KiB/s): min=  212, max=41095, per=13.55%, avg=8764.74, stdev=2446.92, samples=121328
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=121328
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=2.66%, 4=71.50%, 10=25.73%, 20=0.03%, 100=0.01%
  lat (msec)   : 250=0.05%
  cpu          : usr=0.85%, sys=1.31%, ctx=111285, majf=0, minf=4380
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,121328,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_32k_read: (groupid=1, jobs=1): err= 0: pid=5504: Mon Sep 24 13:12:17 2018
   read: IOPS=2062, BW=64.4MiB/s (67.6MB/s)(3867MiB/60002msec)
    slat (nsec): min=2677, max=70790, avg=3486.53, stdev=648.50
    clat (usec): min=439, max=148529, avg=3873.68, stdev=3197.61
     lat (usec): min=442, max=148533, avg=3877.31, stdev=3197.59
    clat percentiles (usec):
     |  1.00th=[   914],  5.00th=[  3032], 10.00th=[  3752], 20.00th=[  3818],
     | 30.00th=[  3851], 40.00th=[  3884], 50.00th=[  3884], 60.00th=[  3916],
     | 70.00th=[  3916], 80.00th=[  3949], 90.00th=[  4015], 95.00th=[  4080],
     | 99.00th=[  5669], 99.50th=[  5932], 99.90th=[  8291], 99.95th=[111674],
     | 99.99th=[143655]
   bw (  KiB/s): min=  220, max=74593, per=14.27%, avg=9414.54, stdev=5023.56, samples=123747
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=123747
  lat (usec)   : 500=0.01%, 750=0.18%, 1000=1.72%
  lat (msec)   : 2=2.38%, 4=85.17%, 10=10.47%, 20=0.01%, 100=0.01%
  lat (msec)   : 250=0.05%
  cpu          : usr=0.61%, sys=1.51%, ctx=123713, majf=0, minf=4910
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=123747,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=47.1MiB/s (49.4MB/s), 47.1MiB/s-47.1MiB/s (49.4MB/s-49.4MB/s), io=47.8MiB (50.1MB), run=1014-1014msec

Run status group 1 (all jobs):
   READ: bw=64.4MiB/s (67.6MB/s), 64.4MiB/s-64.4MiB/s (67.6MB/s-67.6MB/s), io=3867MiB (4055MB), run=60002-60002msec
  WRITE: bw=63.2MiB/s (66.3MB/s), 63.2MiB/s-63.2MiB/s (66.3MB/s-66.3MB/s), io=3792MiB (3976MB), run=60003-60003msec

Disk stats (read/write):
  nvme0n1: ios=123747/122915, merge=0/0, ticks=478648/486860, in_queue=965488, util=99.42%