results/aws-m5d.large-ebs/reports/lcs.64k.fio.out
lcs_setup: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
lcs_64k_write: (g=1): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
lcs_64k_read: (g=1): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
fio-3.10-28-g9f2c
Starting 3 threads
lcs_setup: Laying out IO files (10 files / total 1600MiB)
lcs_64k_write: Laying out IO files (10 files / total 1600MiB)
lcs_64k_read: Laying out IO files (10 files / total 1600MiB)

lcs_setup: (groupid=0, jobs=1): err= 0: pid=5536: Mon Sep 24 13:13:29 2018
  write: IOPS=733, BW=45.8MiB/s (48.1MB/s)(46.9MiB/1024msec)
    slat (nsec): min=4230, max=30820, avg=6419.86, stdev=1850.31
    clat (usec): min=868, max=101880, avg=10733.57, stdev=9708.46
     lat (usec): min=881, max=101885, avg=10740.09, stdev=9708.17
    clat percentiles (usec):
     |  1.00th=[  1696],  5.00th=[  2769], 10.00th=[  3163], 20.00th=[  4424],
     | 30.00th=[ 11076], 40.00th=[ 11469], 50.00th=[ 11600], 60.00th=[ 11731],
     | 70.00th=[ 11863], 80.00th=[ 11994], 90.00th=[ 12387], 95.00th=[ 12780],
     | 99.00th=[ 93848], 99.50th=[ 94897], 99.90th=[102237], 99.95th=[102237],
     | 99.99th=[102237]
   bw (  KiB/s): min=43648, max=51456, per=100.00%, avg=47552.00, stdev=5521.09, samples=2
   iops        : min=  682, max=  804, avg=743.00, stdev=86.27, samples=2
  lat (usec)   : 1000=0.27%
  lat (msec)   : 2=1.20%, 4=16.38%, 10=6.79%, 20=74.30%, 100=0.67%
  lat (msec)   : 250=0.40%
  cpu          : usr=0.39%, sys=0.39%, ctx=727, majf=0, minf=1
  IO depths    : 1=1.5%, 2=0.3%, 4=0.5%, 8=99.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,751,0,10 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_64k_write: (groupid=1, jobs=1): err= 0: pid=5537: Mon Sep 24 13:13:29 2018
  write: IOPS=1007, BW=62.0MiB/s (66.0MB/s)(3779MiB/60007msec)
    slat (usec): min=3, max=4205, avg= 6.08, stdev=19.50
    clat (usec): min=1162, max=158696, avg=7930.03, stdev=6006.97
     lat (usec): min=1170, max=158701, avg=7936.27, stdev=6006.91
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    7], 10.00th=[    8], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    9], 95.00th=[    9],
     | 99.00th=[   12], 99.50th=[   13], 99.90th=[  130], 99.95th=[  144],
     | 99.99th=[  155]
   bw (  KiB/s): min=  412, max=56357, per=14.16%, avg=9128.89, stdev=3912.92, samples=60469
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=60469
  lat (msec)   : 2=0.45%, 4=3.59%, 10=94.54%, 20=1.13%, 50=0.02%
  lat (msec)   : 100=0.08%, 250=0.20%
  cpu          : usr=0.51%, sys=0.67%, ctx=59104, majf=0, minf=2366
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,60469,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_64k_read: (groupid=1, jobs=1): err= 0: pid=5538: Mon Sep 24 13:13:29 2018
   read: IOPS=1028, BW=64.3MiB/s (67.4MB/s)(3857MiB/60008msec)
    slat (nsec): min=3602, max=28743, avg=4695.78, stdev=823.88
    clat (usec): min=458, max=156244, avg=7771.09, stdev=5986.91
     lat (usec): min=463, max=156248, avg=7775.94, stdev=5986.88
    clat percentiles (usec):
     |  1.00th=[  1532],  5.00th=[  2040], 10.00th=[  7570], 20.00th=[  7701],
     | 30.00th=[  7767], 40.00th=[  7767], 50.00th=[  7767], 60.00th=[  7832],
     | 70.00th=[  7832], 80.00th=[  7832], 90.00th=[  7898], 95.00th=[  7963],
     | 99.00th=[ 11600], 99.50th=[ 11863], 99.90th=[128451], 99.95th=[141558],
     | 99.99th=[156238]
   bw (  KiB/s): min=  419, max=143022, per=15.32%, avg=10080.04, stdev=7072.43, samples=61712
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=61712
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=4.88%, 4=0.93%, 10=92.83%, 20=1.08%, 50=0.02%
  lat (msec)   : 100=0.07%, 250=0.20%
  cpu          : usr=0.25%, sys=0.90%, ctx=61705, majf=0, minf=2544
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=61712,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=45.8MiB/s (48.1MB/s), 45.8MiB/s-45.8MiB/s (48.1MB/s-48.1MB/s), io=46.9MiB (49.2MB), run=1024-1024msec

Run status group 1 (all jobs):
   READ: bw=64.3MiB/s (67.4MB/s), 64.3MiB/s-64.3MiB/s (67.4MB/s-67.4MB/s), io=3857MiB (4044MB), run=60008-60008msec
  WRITE: bw=62.0MiB/s (66.0MB/s), 62.0MiB/s-62.0MiB/s (66.0MB/s-66.0MB/s), io=3779MiB (3963MB), run=60007-60007msec

Disk stats (read/write):
  nvme0n1: ios=61712/61389, merge=0/0, ticks=479308/494740, in_queue=974032, util=99.69%